espressif/esp-eth-drivers/common_examples/simple-ethernet/sdkconfig.ci.yt8531_esp32s31
CONFIG_IDF_TARGET="esp32s31"

CONFIG_ETHERNET_INTERNAL_SUPPORT=y

CONFIG_ETHERNET_PHY_IP101=n
CONFIG_ETHERNET_PHY_RTL8201=n
CONFIG_ETHERNET_PHY_LAN87XX=n
CONFIG_ETHERNET_PHY_DP83848=n
CONFIG_ETHERNET_PHY_KSZ80XX=n
CONFIG_ETHERNET_PHY_LAN867X=n
CONFIG_ETHERNET_PHY_VSC8541=n
CONFIG_ETHERNET_PHY_YT8531=y

CONFIG_ETHERNET_PHY_INTERFACE_DEFAULT=y

CONFIG_ETHERNET_MDC_GPIO=5
CONFIG_ETHERNET_MDIO_GPIO=6
CONFIG_ETHERNET_PHY_RST_GPIO=7

CONFIG_ETHERNET_SPI_SUPPORT=n
